Revit 2024 API
LinkElementId Class
 LinkElementId represents an element in a linked document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class LinkElementId
Visual Basic
Public Class LinkElementId
Visual C++
public ref class LinkElementId
Remarks
 The id contains two element ids:
The id of the linked model element in host document.
The id of the element in the linked model document.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.LinkElementId
See Also
LinkElementId Members
Autodesk.Revit.DB Namespace